app/controllers/application_controller.rb

  def current_user
    user = User.find(decoded_token[0]["user_id"])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]