app/controllers/auth_controller.rb

  def login
    # params: { username: '', password: '' }

    # find the user by their username
    user = User.find_by(username: params["username"])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "al"], ["LIMIT", 1]]