app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
  def index
    # trips = @all.find_by(user_id: session_user.id)
    @all = Trip.all
    trips = @all.find_all { |trip| trip.user_id == session_user.id }

INSERT INTO "trips" ("title", "destination", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "ffdd"], ["destination", "American Samoa"], ["user_id", 2], ["created_at", "2019-06-28 13:24:04.860028"], ["updated_at", "2019-06-28 13:24:04.860028"]]
SELECT "trips".* FROM "trips"
INSERT INTO "days" ("trip_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["trip_id", 52], ["created_at", "2019-07-01 15:28:14.035245"], ["updated_at", "2019-07-01 15:28:14.035245"]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
SELECT "days".* FROM "days"
---
  def create
    trip = Trip.create(trips_params)

    # calculate number of days in between two dates
    startDate = Date.parse(params[:trip][:startDate])
    endDate = Date.parse(params[:trip][:endDate])
    days = endDate.mjd - startDate.mjd + 1

    # find the trip_id for the new trip
    title = params[:trip][:title]
    theTrip = Trip.all.find{ |trip| trip.title == title }

    # create number of DAYs for that trip
    x = 1
    while x <= days
      Day.create(trip_id: theTrip.id)
      x += 1
    end

    theDays = Day.all.find_all{ |day| day.trip_id == theTrip.id }

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "trips" SET "title" = $1, "startDate" = $2, "endDate" = $3, "destination" = $4, "updated_at" = $5 WHERE "trips"."id" = $6  [["title", ""], ["startDate", "2019-06-01"], ["endDate", "2019-06-08"], ["destination", ""], ["updated_at", "2019-06-28 15:16:58.096429"], ["id", 1]]
---
  def update
    theTrip = Trip.find(params[:id])
    updatedTrip = theTrip.update(trips_params)

SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
SELECT  "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 70], ["LIMIT", 1]]
SELECT "days".* FROM "days"
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 73]]
DELETE FROM "days" WHERE "days"."id" = $1  [["id", 41]]
DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 70]]
---
  def destroy
    theTrip = Trip.find(params[:id])
    theDays = Day.all.find_all{|day| day.trip_id == theTrip.id}
    theDays.each{|day| day.delete}
    theTrip.destroy