app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "tom"], ["password_digest", "$2a$12$nNGlxPz6vf0c09j9f.0HMOb0vqckUYNb75Vjou8ybVj64bCsQl/mK"], ["created_at", "2019-06-24 17:51:40.367010"], ["updated_at", "2019-06-24 17:51:40.367010"]]
---
  def create
    # params: { username: '', password: '' }
    user = User.create(user_params)